# Part 01 - Titanic Dataset

In [52]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head(10)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
5,6,"Moran, Mr. James",3,male,NaN,0,0,330877,8.4583,NaN,Q,0
6,7,"McCarthy, Mr. Timothy J",1,male,54.0,0,0,17463,51.8625,E46,S,0
7,8,"Palsson, Master. Gosta Leonard",3,male,2.0,3,1,349909,21.0750,NaN,S,0
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",3,female,27.0,0,2,347742,11.1333,NaN,S,1
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",2,female,14.0,1,0,237736,30.0708,NaN,C,1

In [53]:
df.shape

(891, 12)

In [54]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)
df.head(10)

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0
5       3    male   NaN   8.4583         0
6       1    male  54.0  51.8625         0
7       3    male   2.0  21.0750         0
8       3  female  27.0  11.1333         1
9       2  female  14.0  30.0708         1

In [55]:
target = df.Survived
inputs = df.drop('Survived', axis='columns')

In [56]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(5)

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [57]:
inputs = pd.concat([inputs,dummies], axis='columns')
inputs.head(5)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [58]:
inputs.drop('Sex', axis='columns', inplace=True)
inputs.head(5)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [59]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [60]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(7)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1

In [79]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [80]:
len(X_train)

712

In [81]:
len(X_test)

179

In [82]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [83]:
model.fit(X_train, y_train)

GaussianNB()

In [84]:
model.score(X_test, y_test)

0.7988826815642458

In [86]:
X_test[:10]

     Pclass        Age     Fare  female  male
201       3  29.699118  69.5500       0     1
364       3  29.699118  15.5000       0     1
809       1  33.000000  53.1000       1     0
729       3  25.000000   7.9250       1     0
274       3  29.699118   7.7500       1     0
202       3  34.000000   6.4958       0     1
628       3  26.000000   7.8958       0     1
504       1  16.000000  86.5000       1     0
425       3  29.699118   7.2500       0     1
648       3  29.699118   7.5500       0     1

In [87]:
y_test[:10]

201    0
364    0
809    1
729    0
274    1
202    0
628    0
504    1
425    0
648    0
Name: Survived, dtype: int64

In [88]:
model.predict(X_test[:10])

array([0, 0, 1, 1, 1, 0, 0, 1, 0, 0], dtype=int64)

In [89]:
model.predict_proba(X_test[:10])

array([[9.62976879e-01, 3.70231215e-02],
       [9.87475828e-01, 1.25241715e-02],
       [5.21929179e-03, 9.94780708e-01],
       [5.05418823e-02, 9.49458118e-01],
       [5.46699210e-02, 9.45330079e-01],
       [9.87887992e-01, 1.21120079e-02],
       [9.86429413e-01, 1.35705873e-02],
       [9.51981606e-04, 9.99048018e-01],
       [9.87219782e-01, 1.27802177e-02],
       [9.87240281e-01, 1.27597194e-02]])

# Part 02 - Spam Email

In [90]:
import pandas as pd
df0 = pd.read_csv('spam.csv')
df0.head(10)

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...
5     spam  FreeMsg Hey there darling it's been 3 week's n...
6      ham  Even my brother is not like to speak with me. ...
7      ham  As per your request 'Melle Melle (Oru Minnamin...
8     spam  WINNER!! As a valued network customer you have...
9     spam  Had your mobile 11 months or more? U R entitle...

In [95]:
df0.groupby('Category').describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4

In [98]:
df0['spam'] = df0['Category'].apply(lambda x: 1 if x=='spam' else 0)
df0.head(10)

  Category                                            Message  spam
0      ham  Go until jurong point, crazy.. Available only ...     0
1      ham                      Ok lar... Joking wif u oni...     0
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...     1
3      ham  U dun say so early hor... U c already then say...     0
4      ham  Nah I don't think he goes to usf, he lives aro...     0
5     spam  FreeMsg Hey there darling it's been 3 week's n...     1
6      ham  Even my brother is not like to speak with me. ...     0
7      ham  As per your request 'Melle Melle (Oru Minnamin...     0
8     spam  WINNER!! As a valued network customer you have...     1
9     spam  Had your mobile 11 months or more? U R entitle...     1

In [112]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(df0.Message, df0.Category, test_size=0.25)

In [113]:
from sklearn.feature_extraction.text import CountVectorizer
v = CountVectorizer()
X_train_count = v.fit_transform(X_train.values)
X_train_count.toarray()[:3]

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [114]:
from sklearn.naive_bayes import MultinomialNB
model = MultinomialNB()
model.fit(X_train_count, y_train)

MultinomialNB()

In [115]:
## 4148, 3671, 3176

emails = [
    'Lol I would but despite these cramps I like being a girl.',
    'Thanks for loving me so. You rock',
    'Dear Voucher Holder, To claim this weeks offer, at you PC please go to http://www.e-tlp.co.uk/reward. Ts&Cs apply.'
]

emails_count = v.transform(emails)
model.predict(emails_count)

array(['ham', 'ham', 'spam'], dtype='<U4')

In [116]:
X_test_count = v.transform(X_test)
model.score(X_test_count, y_test)

0.9877961234745154

In [117]:
from sklearn.pipeline import Pipeline
clf = Pipeline([('vectorizer', CountVectorizer()), ('nb', MultinomialNB())])

In [118]:
clf.fit(X_train, y_train)

Pipeline(steps=[('vectorizer', CountVectorizer()), ('nb', MultinomialNB())])

In [119]:
clf.score(X_test, y_test)

0.9877961234745154

In [120]:
clf.predict(emails)

array(['ham', 'ham', 'spam'], dtype='<U4')